#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<locale.h>

int main()
{
	setlocale(LC_ALL, "Rus");

	char name1[9], name2[9], name3[9], type1, type2, type3;
	int square1, square2, square3, workers1, workers2, workers3;
		
	printf("1. Введите название сельскохозяйственного предприятия, вид собственности, площадь земли (га) и количество работников: ");
	scanf("%s %c %d %d", name1, &type1, &square1, &workers1);
	printf("2. Введите название сельскохозяйственного предприятия, вид собственности, площадь земли (га) и количество работников: ");
	scanf("%s %c %d %d", name2, &type2, &square2, &workers2);
	printf("3. Введите название сельскохозяйственного предприятия, вид собственности, площадь земли (га) и количество работников: ");
	scanf("%s %c %d %d", name3, &type3, &square3, &workers3);

	
	puts("------------------------------------------------------------------");
	printf("|                Сельскохозяйственные предприятия                |\n");
	puts("------------------------------------------------------------------");
	printf("| Название | Вид собственности | Площадь земли | Кол. работников |\n");
	puts("------------------------------------------------------------------");
	printf("|%9s |         %c         |      %-3d      |       %-3d       |\n", name1, type1, square1, workers1);
	puts("------------------------------------------------------------------");
	printf("|%9s |         %c         |      %-3d      |       %-3d       |\n", name2, type2, square2, workers2);
	puts("------------------------------------------------------------------");
	printf("|%9s |         %c         |      %-3d      |       %-3d       |\n", name3, type3, square3, workers3);
	puts("------------------------------------------------------------------");
	puts("|Вид собственности: Д-государственная, Ч-частная, К-кооперативная|");
	puts("------------------------------------------------------------------");
	return(0);
}
